curl.org
#+INCLUDE: ./main.setup
#+TITLE: curl
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-20

| Version              | {{{ver(7.58.0)}}}      |
| Release Date         | {{{date(2018-01-24)}}} |
| Package Size         | {{{size(135KB)}}}      |
| Installed Size       | {{{size(331KB)}}}      |
| Programming Language | C                      |

* Visión de conjunto
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG: es
  :END:      

Una herramienta de línea de comandos y una biblioteca para transferir datos con sintaxis de URL, compatible con HTTP, HTTPS, FTP, FTPS, GOPHER, TFTP, SCP, SFTP, SMB, TELNET, DICT, LDAP, LDAPS, ARCHIVO, IMAP, SMTP, POP3, RTSP y RTMP. libcurl ofrece una miríada de potentes funciones

* Cómo instalar
  :PROPERTIES: 
  :CUSTOM_ID: how-to-install
  :LANG: es
  :END:      

** Dependencias
   :PROPERTIES: 
   :CUSTOM_ID: dependencies
   :LANG: es
   :END:      

- libc6 (>= {{{ver(2.17)}}})
- libcurl3-gnutls (= {{{ver(7.58.0)}}})
- zlib1g (>= {{{ver(1:1.1.4)}}})

** Instalar
  :PROPERTIES: 
  :CUSTOM_ID: install
  :LANG: es
  :END:      

*** Ubuntu

#+BEGIN_SRC sh
$ sudo apt-get install curl
#+END_SRC

*** CentOS

#+BEGIN_SRC sh
$ sudo yum install curl
#+END_SRC

*** from Source code

#+BEGIN_SRC sh
$ git clone https://github.com/curl/curl.git
$ ./configure
$ make
$ sudo make install
#+END_SRC

** Paquetes instalados
   :PROPERTIES: 
   :CUSTOM_ID: packages
   :LANG: es
   :END:      

- curl

** Comprobar
   :PROPERTIES: 
   :CUSTOM_ID: check
   :LANG: es
   :END:      

#+BEGIN_SRC sh
$ curl --version
#+END_SRC

#+BEGIN_EXAMPLE
curl 7.47.0 (x86_64-pc-linux-gnu) libcurl/7.47.0 GnuTLS/3.4.10 zlib/1.2.8 libidn/1.32 librtmp/2.3
Protocols: dict file ftp ftps gopher http https imap imaps ldap ldaps pop3 pop3s rtmp rtsp smb smbs smtp smtps telnet tftp
Features: AsynchDNS IDN IPv6 Largefile GSS-API Kerberos SPNEGO NTLM NTLM_WB SSL libz TLS-SRP UnixSockets
#+END_EXAMPLE

 Cuando comprueba la versión, las bibliotecas compatibles y los protocolos y características admitidos se envían juntos.

* Uso
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG: es
  :END:      

** Sintaxis
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG: es
   :END:      

#+BEGIN_SRC sh
curl [options] [URL...]
#+END_SRC

# ** Configuration
#    :PROPERTIES: 
#    :CUSTOM_ID: configuration
#    :LANG_EN:  Configuration
#    :LANG_ES:  Configuración
#    :LANG_KO:  설정
#    :LANG_ZH:  组态
#    :LANG_JA:  設定
#    :END:      

